GopalSaraf/Practicals/PSDL/include/proc/pic16f18046.inc
// Register: ADUTHL
#define ADUTHL ADUTHL
ADUTHL                                   equ 01D0Eh
// bitfield definitions
ADUTHL_UTH_POSN                          equ 0000h
ADUTHL_UTH_POSITION                      equ 0000h
ADUTHL_UTH_SIZE                          equ 0008h
ADUTHL_UTH_LENGTH                        equ 0008h
ADUTHL_UTH_MASK                          equ 00FFh
ADUTHL_ADUTH0_POSN                       equ 0000h
ADUTHL_ADUTH0_POSITION                   equ 0000h
ADUTHL_ADUTH0_SIZE                       equ 0001h
ADUTHL_ADUTH0_LENGTH                     equ 0001h
ADUTHL_ADUTH0_MASK                       equ 0001h
ADUTHL_ADUTH1_POSN                       equ 0001h
ADUTHL_ADUTH1_POSITION                   equ 0001h
ADUTHL_ADUTH1_SIZE                       equ 0001h
ADUTHL_ADUTH1_LENGTH                     equ 0001h
ADUTHL_ADUTH1_MASK                       equ 0002h
ADUTHL_ADUTH2_POSN                       equ 0002h
ADUTHL_ADUTH2_POSITION                   equ 0002h
ADUTHL_ADUTH2_SIZE                       equ 0001h
ADUTHL_ADUTH2_LENGTH                     equ 0001h
ADUTHL_ADUTH2_MASK                       equ 0004h
ADUTHL_ADUTH3_POSN                       equ 0003h
ADUTHL_ADUTH3_POSITION                   equ 0003h
ADUTHL_ADUTH3_SIZE                       equ 0001h
ADUTHL_ADUTH3_LENGTH                     equ 0001h
ADUTHL_ADUTH3_MASK                       equ 0008h
ADUTHL_ADUTH4_POSN                       equ 0004h
ADUTHL_ADUTH4_POSITION                   equ 0004h
ADUTHL_ADUTH4_SIZE                       equ 0001h
ADUTHL_ADUTH4_LENGTH                     equ 0001h
ADUTHL_ADUTH4_MASK                       equ 0010h
ADUTHL_ADUTH5_POSN                       equ 0005h
ADUTHL_ADUTH5_POSITION                   equ 0005h
ADUTHL_ADUTH5_SIZE                       equ 0001h
ADUTHL_ADUTH5_LENGTH                     equ 0001h
ADUTHL_ADUTH5_MASK                       equ 0020h
ADUTHL_ADUTH6_POSN                       equ 0006h
ADUTHL_ADUTH6_POSITION                   equ 0006h
ADUTHL_ADUTH6_SIZE                       equ 0001h
ADUTHL_ADUTH6_LENGTH                     equ 0001h
ADUTHL_ADUTH6_MASK                       equ 0040h
ADUTHL_ADUTH7_POSN                       equ 0007h
ADUTHL_ADUTH7_POSITION                   equ 0007h
ADUTHL_ADUTH7_SIZE                       equ 0001h
ADUTHL_ADUTH7_LENGTH                     equ 0001h
ADUTHL_ADUTH7_MASK                       equ 0080h
ADUTHL_ADUTH_POSN                        equ 0000h
ADUTHL_ADUTH_POSITION                    equ 0000h
ADUTHL_ADUTH_SIZE                        equ 0008h
ADUTHL_ADUTH_LENGTH                      equ 0008h
ADUTHL_ADUTH_MASK                        equ 00FFh
ADUTHL_UTH0_POSN                         equ 0000h
ADUTHL_UTH0_POSITION                     equ 0000h
ADUTHL_UTH0_SIZE                         equ 0001h
ADUTHL_UTH0_LENGTH                       equ 0001h
ADUTHL_UTH0_MASK                         equ 0001h
ADUTHL_UTH1_POSN                         equ 0001h
ADUTHL_UTH1_POSITION                     equ 0001h
ADUTHL_UTH1_SIZE                         equ 0001h
ADUTHL_UTH1_LENGTH                       equ 0001h
ADUTHL_UTH1_MASK                         equ 0002h
ADUTHL_UTH2_POSN                         equ 0002h
ADUTHL_UTH2_POSITION                     equ 0002h
ADUTHL_UTH2_SIZE                         equ 0001h
ADUTHL_UTH2_LENGTH                       equ 0001h
ADUTHL_UTH2_MASK                         equ 0004h
ADUTHL_UTH3_POSN                         equ 0003h
ADUTHL_UTH3_POSITION                     equ 0003h
ADUTHL_UTH3_SIZE                         equ 0001h
ADUTHL_UTH3_LENGTH                       equ 0001h
ADUTHL_UTH3_MASK                         equ 0008h
ADUTHL_UTH4_POSN                         equ 0004h
ADUTHL_UTH4_POSITION                     equ 0004h
ADUTHL_UTH4_SIZE                         equ 0001h
ADUTHL_UTH4_LENGTH                       equ 0001h
ADUTHL_UTH4_MASK                         equ 0010h
ADUTHL_UTH5_POSN                         equ 0005h
ADUTHL_UTH5_POSITION                     equ 0005h
ADUTHL_UTH5_SIZE                         equ 0001h
ADUTHL_UTH5_LENGTH                       equ 0001h
ADUTHL_UTH5_MASK                         equ 0020h
ADUTHL_UTH6_POSN                         equ 0006h
ADUTHL_UTH6_POSITION                     equ 0006h
ADUTHL_UTH6_SIZE                         equ 0001h
ADUTHL_UTH6_LENGTH                       equ 0001h
ADUTHL_UTH6_MASK                         equ 0040h
ADUTHL_UTH7_POSN                         equ 0007h
ADUTHL_UTH7_POSITION                     equ 0007h
ADUTHL_UTH7_SIZE                         equ 0001h
ADUTHL_UTH7_LENGTH                       equ 0001h
ADUTHL_UTH7_MASK                         equ 0080h

// Register: ADUTHH
#define ADUTHH ADUTHH
ADUTHH                                   equ 01D0Fh
// bitfield definitions
ADUTHH_UTH_POSN                          equ 0000h
ADUTHH_UTH_POSITION                      equ 0000h
ADUTHH_UTH_SIZE                          equ 0008h
ADUTHH_UTH_LENGTH                        equ 0008h
ADUTHH_UTH_MASK                          equ 00FFh
ADUTHH_ADUTH8_POSN                       equ 0000h
ADUTHH_ADUTH8_POSITION                   equ 0000h
ADUTHH_ADUTH8_SIZE                       equ 0001h
ADUTHH_ADUTH8_LENGTH                     equ 0001h
ADUTHH_ADUTH8_MASK                       equ 0001h
ADUTHH_ADUTH9_POSN                       equ 0001h
ADUTHH_ADUTH9_POSITION                   equ 0001h
ADUTHH_ADUTH9_SIZE                       equ 0001h
ADUTHH_ADUTH9_LENGTH                     equ 0001h
ADUTHH_ADUTH9_MASK                       equ 0002h
ADUTHH_ADUTH10_POSN                      equ 0002h
ADUTHH_ADUTH10_POSITION                  equ 0002h
ADUTHH_ADUTH10_SIZE                      equ 0001h
ADUTHH_ADUTH10_LENGTH                    equ 0001h
ADUTHH_ADUTH10_MASK                      equ 0004h
ADUTHH_ADUTH11_POSN                      equ 0003h
ADUTHH_ADUTH11_POSITION                  equ 0003h
ADUTHH_ADUTH11_SIZE                      equ 0001h
ADUTHH_ADUTH11_LENGTH                    equ 0001h
ADUTHH_ADUTH11_MASK                      equ 0008h
ADUTHH_ADUTH12_POSN                      equ 0004h
ADUTHH_ADUTH12_POSITION                  equ 0004h
ADUTHH_ADUTH12_SIZE                      equ 0001h
ADUTHH_ADUTH12_LENGTH                    equ 0001h
ADUTHH_ADUTH12_MASK                      equ 0010h
ADUTHH_ADUTH13_POSN                      equ 0005h
ADUTHH_ADUTH13_POSITION                  equ 0005h
ADUTHH_ADUTH13_SIZE                      equ 0001h
ADUTHH_ADUTH13_LENGTH                    equ 0001h
ADUTHH_ADUTH13_MASK                      equ 0020h
ADUTHH_ADUTH14_POSN                      equ 0006h
ADUTHH_ADUTH14_POSITION                  equ 0006h
ADUTHH_ADUTH14_SIZE                      equ 0001h
ADUTHH_ADUTH14_LENGTH                    equ 0001h
ADUTHH_ADUTH14_MASK                      equ 0040h
ADUTHH_ADUTH15_POSN                      equ 0007h
ADUTHH_ADUTH15_POSITION                  equ 0007h
ADUTHH_ADUTH15_SIZE                      equ 0001h
ADUTHH_ADUTH15_LENGTH                    equ 0001h
ADUTHH_ADUTH15_MASK                      equ 0080h
ADUTHH_ADUTH_POSN                        equ 0000h
ADUTHH_ADUTH_POSITION                    equ 0000h
ADUTHH_ADUTH_SIZE                        equ 0008h
ADUTHH_ADUTH_LENGTH                      equ 0008h
ADUTHH_ADUTH_MASK                        equ 00FFh
ADUTHH_UTH8_POSN                         equ 0000h
ADUTHH_UTH8_POSITION                     equ 0000h
ADUTHH_UTH8_SIZE                         equ 0001h
ADUTHH_UTH8_LENGTH                       equ 0001h
ADUTHH_UTH8_MASK                         equ 0001h
ADUTHH_UTH9_POSN                         equ 0001h
ADUTHH_UTH9_POSITION                     equ 0001h
ADUTHH_UTH9_SIZE                         equ 0001h
ADUTHH_UTH9_LENGTH                       equ 0001h
ADUTHH_UTH9_MASK                         equ 0002h
ADUTHH_UTH10_POSN                        equ 0002h
ADUTHH_UTH10_POSITION                    equ 0002h
ADUTHH_UTH10_SIZE                        equ 0001h
ADUTHH_UTH10_LENGTH                      equ 0001h
ADUTHH_UTH10_MASK                        equ 0004h
ADUTHH_UTH11_POSN                        equ 0003h
ADUTHH_UTH11_POSITION                    equ 0003h
ADUTHH_UTH11_SIZE                        equ 0001h
ADUTHH_UTH11_LENGTH                      equ 0001h
ADUTHH_UTH11_MASK                        equ 0008h
ADUTHH_UTH12_POSN                        equ 0004h
ADUTHH_UTH12_POSITION                    equ 0004h
ADUTHH_UTH12_SIZE                        equ 0001h
ADUTHH_UTH12_LENGTH                      equ 0001h
ADUTHH_UTH12_MASK                        equ 0010h
ADUTHH_UTH13_POSN                        equ 0005h
ADUTHH_UTH13_POSITION                    equ 0005h
ADUTHH_UTH13_SIZE                        equ 0001h
ADUTHH_UTH13_LENGTH                      equ 0001h
ADUTHH_UTH13_MASK                        equ 0020h
ADUTHH_UTH14_POSN                        equ 0006h
ADUTHH_UTH14_POSITION                    equ 0006h
ADUTHH_UTH14_SIZE                        equ 0001h
ADUTHH_UTH14_LENGTH                      equ 0001h
ADUTHH_UTH14_MASK                        equ 0040h
ADUTHH_UTH15_POSN                        equ 0007h
ADUTHH_UTH15_POSITION                    equ 0007h
ADUTHH_UTH15_SIZE                        equ 0001h
ADUTHH_UTH15_LENGTH                      equ 0001h
ADUTHH_UTH15_MASK                        equ 0080h

